# Создайте программу для игры с конфетами человек против человека.

# Условие задачи: На столе лежит 2021 конфета. Играют два игрока делая ход друг после друга. 
# Первый ход определяется жеребьёвкой. За один ход можно забрать не более чем 28 конфет. 
# Все конфеты оппонента достаются сделавшему последний ход. Сколько конфет нужно взять первому игроку, 
# чтобы забрать все конфеты у своего конкурента?

table = 2021
turn = 1

def MovePlayer():
    move = int(input(f"сколько конфет берет игрок {turn}?"))
    if move > 28 or move < 1:
        print("введено неверное значение. верно вводить целые числа от 1 до 28")
        move = 0
    return move 

while table > 0:
    move = MovePlayer()
    if move == 0:
        move = MovePlayer()    
    table -= move
    if turn == 1:
        turn = 2
    else: turn = 1
    print(f"на столе {table} конфет")
if turn == 1:
    print("победил игрок 2")
else: print("победил игрок 1")
