# Создайте программу для игры с конфетами человек против человека.

# Условие задачи: На столе лежит 2021 конфета. Играют два игрока делая ход друг после друга. 
# Первый ход определяется жеребьёвкой. За один ход можно забрать не более чем 28 конфет. 
# Все конфеты оппонента достаются сделавшему последний ход. Сколько конфет нужно взять первому игроку, 
# чтобы забрать все конфеты у своего конкурента?

# a) Добавьте игру против бота

from random import randint

def MovePlayer():
    move = int(input(f"сколько конфет берет игрок {turn}?"))
    if move > 28 or move < 1:
        print("введено неверное значение. верно вводить целые числа от 1 до 28")
        move = 0
    return move 

table = 2021
turn = int(input('Кто начнет игру? Введите "1", если первым ходит игрок, введите "2", если первым ходит бот'))
if turn != 1 and turn != 2:
    print('неверный ввод. в таком случае, первым будет ходить бот')

while table > 0:
    if turn == 1:
        move = MovePlayer()
        table -= move
        print(f"на столе {table} конфет")
        if move != 0:
            turn = 2
    else: 
        move = randint(1, 28)
        table -= move
        print(f"бот берет {move} конфет. на столе {table} конфет")
        turn = 1

if turn == 1:
    print("победил бот")
else: print("победил игрок")